var optaEventCodes = {1:{name:"Pass",description:"Any pass attempted from one player to another – free kicks, corners, throw ins, goal kicks and goal assists"},2:{name:"Offside Pass",description:"Attempted pass made to a player who is in an offside position"},3:{name:"Take On",description:"Attempted dribble past an opponent (excluding when qualifier 211 is present as this is ‘overrun’ and is not always a duel event)"},4:{name:"Foul",description:"This event is shown when a foul is committed resulting in a free kick"},5:{name:"Out",description:"Shown each time the ball goes out of play for a throw-in or goal kick"},6:{name:"Corner Awarded",description:"Ball goes out of play for a corner kick"},7:{name:"Tackle",description:"Tackle = dispossesses an opponent of the ball - Outcome 1 = win & retain possession or out of play, 0 = win tackle but not possession"},8:{name:"Interception",description:"When a player intercepts any pass event between opposition players and prevents the ball reaching its target. Cannot be a clearance."},9:{name:"Turnover",description:"Unforced error / loss of possession - i.e. bad control of ball – NO LONGER USED (Replaced with Unsuccessful Touch + Overrun)"},10:{name:"Save",description:"Goalkeeper event; saving a shot on goal. Can also be an outfield player event with qualifier 94 for blocked shot"},11:{name:"Claim",description:"Goalkeeper event; catching a crossed ball"},12:{name:"Clearance",description:"Player under pressure hits the ball clear of the defensive zone or/and out of play"},13:{name:"Miss",description:"Any shot on goal which goes wide or over the goal"},14:{name:"Post",description:"Whenever the ball hits the frame of the goal"},15:{name:"Attempt Saved",description:"Shot saved - this event is for the player who made the shot. Qualifier 82 can be added for blocked shot."},16:{name:"Goal",description:"All goals"},17:{name:"Card",description:"Bookings; will have red, yellow or 2nd yellow qualifier plus a reason"},18:{name:"Player off",description:"Player is substituted off"},19:{name:"Player on",description:"Player comes on as a substitute"},20:{name:"Player retired",description:"Player is forced to leave the pitch due to injury and the team have no substitutions left"},21:{name:"Player returns",description:"Player comes back on the pitch"},22:{name:"Player becomes goalkeeper",description:"When an outfield player has to replace the goalkeeper"},23:{name:"Goalkeeper becomes player",description:"If goalkeeper becomes an outfield player"},24:{name:"Condition change",description:"Change in playing conditions"},25:{name:"Official change",description:"Referee or linesman is replaced"},27:{name:"Start delay",description:"Used when there is a stoppage in play such as a player injury"},28:{name:"End delay",description:"Used when the stoppage ends and play resumes"},30:{name:"End",description:"End of a match period"},32:{name:"Start",description:"Start of a match period"},34:{name:"Team set up",description:"Team line up; qualifiers 30, 44, 59, 130, 131 will show player line up and formation"},35:{name:"Player changed position",description:"Player moved to a different position but the team formation remained the same"},36:{name:"Player changed Jersey number",description:"Player is forced to change jersey number, qualifier will show the new number"},37:{name:"Collection End",description:"Event 30 signals end of half. This signals end of the match and thus data collection."},38:{name:"Temp_Goal",description:"Goal has occurred but it is pending additional detail qualifiers from Opta. Will change to event 16."},39:{name:"Temp_Attempt",description:"Shot on goal has occurred but is pending additional detail qualifiers from Opta. Will change to event 15."},40:{name:"Formation change",description:"Team alters its formation"},41:{name:"Punch",description:"Goalkeeper event; ball is punched clear"},42:{name:"Good Skill",description:"A player shows a good piece of skill on the ball – such as a step over or turn on the ball – NO LONGER USED"},43:{name:"Deleted event",description:"Event has been deleted – the event will remain as it was originally with the same ID but will be resent with the type altered to 43."},44:{name:"Aerial",description:"Aerial duel – 50/50 when the ball is in the air – outcome will represent whether the duel was won or lost"},45:{name:"Challenge",description:"When a player fails to win the ball as an opponent successfully dribbles past them"},47:{name:"Rescinded card",description:"This can occur post match if the referee rescinds a card he has awarded"},49:{name:"Ball recovery",description:"Team wins the possession of the ball and successfully keeps possession for at least two passes or an attacking play"},50:{name:"Dispossessed",description:"Player is successfully tackled and loses possession of the ball"},51:{name:"Error",description:"Mistake by player losing the ball. Leads to a shot or goals as described with qualifier 169 or 170"},52:{name:"Keeper pick-up",description:"Goalkeeper event; picks up the ball"},53:{name:"Cross not claimed",description:"Goalkeeper event; cross not successfully caught"},54:{name:"Smother",description:"Goalkeeper event; comes out and covers the ball in the box winning possession"},55:{name:"Offside provoked",description:"Awarded to last defender when an offside decision is given against an attacker"},56:{name:"Shield ball opp",description:"Defender uses his body to shield the ball from an opponent as it rolls out of play"},57:{name:"Foul throw-in",description:"A throw-in not taken correctly resulting in the throw being awarded to the opposing team"},58:{name:"Penalty faced",description:"Goalkeeper event; penalty by opposition team"},59:{name:"Keeper Sweeper",description:"When keeper comes off his line and/or out of his box to clear the ball"},60:{name:"Chance missed",description:"Used when a player does not actually make a shot on goal but was in a good position to score and only just missed receiving a pass"},61:{name:"Ball touch",description:"Used when a player makes a bad touch on the ball and loses possession. Outcome 1 – ball simply hit the player unintentionally. Outcome 0 – Player unsuccessfully controlled the ball."},63:{name:"Temp_Save",description:"An event indicating a save has occurred but without full details. Event 10 will follow shortly afterwards with full details."},64:{name:"Resume",description:"Match resumes on a new date after being abandoned mid game."},65:{name:"Contentious referee decision",description:"Any major talking point or error made by the referee – decision will be assigned to the relevant team"},66:{name:"Possession Data",description:"Possession event will appear every 5 mins"},67:{name:"50/50",description:"New duel - 2 players running for a loose ball - GERMAN ONLY. Outcome 1 or 0."},68:{name:"Referee Drop Ball",description:"Delay - ref stops - this to event given to both teams on restart. No Outcome"},69:{name:"Failed to Block",description:"New duel (put through-Q266 is the winning duel event). Attempt to block a shot or pass - challenge lost"},70:{name:"Injury Time Announcement",description:"Injury Time awarded by Referee"},71:{name:"Coach Setup",description:"Coach Type; 1,2,18,30,32,54,57,58,59"},72:{name:"Caught Offside",description:"New event to just show player who is offside instead of offside pass event"},73:{name:"Other Ball Contact",description:"This is an automated extra event for DFL. It comes with a tackle or an interception and indicates if the player who made the tackle/interception retained the ball after this action or if the tackle/interception was a single ball touch (other ball contact with type “interception”, type “Defensive Clearance” or type “ TackleRetainedBall)."},74:{name:"Blocked Pass",description:"Defender is close to player in possession and blocks a pass. Different from interception which is where the player has moved to intercept."}}